title: Detect PassTheHash
id: 0ab1590d-286d-4dd5-a179-35530d4a131a
status: test
description : Pass-the-Hash allows an attacker to authenticate using an NTLM hash instead of the plaintext password. By extracting hashes from memory or SAM database, attackers can move laterally across the network without needing the actual password.
references :
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4624
    - https://attack.mitre.org/techniques/T1550/002/
author: Omar-Karajeh
date: 2026-03-24
tags:
    - attack.t1550.002
    - attack.defense-evasion
    - attack.lateral-movement
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID : 4624
        LogonType : 9
        LogonProcessName: 'seclogo'
    condition: selection
level: critical