title: Detect DCSync Active Directory Replication
id: 92d3320e-e5f8-4f98-be42-114bcda3bb20
status: test
author: Omar-Karajeh
description: Detects DCSync attacks where a non-DC account requests AD replication using specific GUIDs. This technique is used to dump all user hashes from the NTDS.dit.
references:
    - https://attack.mitre.org/techniques/T1003/006/
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4662
date: 2026-03-24
tags:
    - attack.t1003.006
    - attack.credential-access
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4662
        Properties|contains:
            - '1131f6aa-9c07-11d1-f79f-00c04fc2dcd2'
            - '1131f6ad-9c07-11d1-f79f-00c04fc2dcd2'
    filter_machine_accounts:
        SubjectUserName|endswith: '$'
    condition: selection and not filter_machine_accounts
level: critical