index=main (EventCode=4662) AND ("1131f6aa-9c07-11d1-f79f-00c04fc2dcd2" OR "1131f6ad-9c07-11d1-f79f-00c04fc2dcd2")
| where NOT match(Account_Name, "\$")
| table _time, ComputerName, Account_Name, Properties
| sort - _time
